[
  {
    "status": "Applied",
    "description": "See it differently  \n\nYou see the world through a unique lens and that’s exactly what we need. We embrace how you see things differently – it’s essential for creating a sustainable future. With your ideas and thinking we can solve the most complex challenges facing our clients, climate and communities.  \n\nView opportunities relevant to your degree here. \n\nWhat our graduate development programme offers you:  \n\nPurpose-driven work: Join an employee-owned team tackling climate, biodiversity, and social challenges, aligned with the UN’s Sustainable Development Goals.\nCreate remarkable outcomes: We trust you to explore challenges, drive change, and create lasting outcomes for our clients, climate and communities.\nInclusive culture: Your unique perspective matters. We celebrate diversity and foster a supportive, social environment where everyone belongs.\nCareer growth: Grow your skills through innovative projects, training, and mentoring in a supportive environment. We invest in your future.\nWork-life balance: Our hybrid model offers flexibility to balance work with your life. We balance your needs with our clients and communities.\n\nWhat we offer you \n\nGuided by our values, we provide a fair and equitable total reward package and offer a career in which all our members can belong, grow and thrive through benefits that support health and wellbeing, a wide range of learning opportunities and many possibilities to have an impact through the work they do.  \n\nWe are owned in trust on behalf of our members, giving us the freedom, with personal responsibility, to set our own direction and choose work that aligns with our purpose and adds to Arup’s legacy.  \n\nExplore the perks of a career with Arup Australia & New Zealand: \n\nProfit Share\nHybrid working policy and flexible working hours.\nPaid parental leave for the primary carer of 16 weeks or 32 weeks at half pay and as well as generous unpaid leave benefits.\nPaid parental leave for the support carer plus the opportunity to access extra paid and unpaid leave if you later become the primary carer.\nBirthday leave\nAnnual leave loading\nAbility to purchase additional leave of up to 20 days for permanent employees.\nInternational mobility opportunities\nInsurances (life and income protection)\nInterest free solar energy and bicycle loans\n\nIs this the role you have been looking for? \n\nWe’re looking for recent and soon-to-be graduates passionate about sustainable development and ready to take on any challenge that comes your way.  You will belong to an extraordinary collective where you can express your individuality, share ideas and create remarkable outcomes.  \n\nEligibility Criteria \n\nCandidates are required to have full working rights in the country they are applying to.\nCandidates must have completed their studies prior to commencing the programme they are applying for\nCandidates must be available to start work on or prior to the first day of the programme they are applying to\nCandidates must not have more than 12 months, full-time experience in a similar role\n\nDifferent people, shared values \n\nArup is an equal opportunity employer that actively promotes and nurtures a diverse and inclusive workforce. We welcome applications from individuals of all backgrounds and embrace diverse experiences, perspectives, and ideas – this drives our excellence.  \n\nWe are committed to making our recruitment process and workplaces accessible to all candidates. Please let us know if you need any assistance or reasonable adjustments throughout your application or interview process, and/or to perform the essential functions of the role. We will do everything we can to support you. \n\nJoin Arup’s #1 ranked Graduate Programme, where your unique ideas help solve the world’s toughest challenges. ",
    "link": "https://au.prosple.com/graduate-employers/arup-australia/jobs-internships/data-computer-science-graduate-development-programme",
    "date": "2025-02-21",
    "alertDate": "",
    "title": "Data & Computer Science Graduate Development Programme (Sep 2025)",
    "company": "Arup Australia",
    "startDate": "1 Sep 2025",
    "index": 0
  },
  {
    "status": "Rejected",
    "description": "Why choose Technology and Digital areas as a grad? \n\nWant to play a part in how technology shapes our world and the world of generations to come? Graduates across technology and digital areas are at the forefront of driving innovation and challenging the status-quo for organisations as they look for ways to harness new developments ethically, sustainably and with maximum efficiency to their customers. Depending on your team and specialisation, you'll deal with day-to-day challenges and big-picture problems facing organisations and society. From ethical hacking and AI to IT strategy development, cyber security, cloud implementation and much more, a graduate role in a digital or tech team will see you set for a career with a big impact for the long term. \n\nLocation of this job: nominate your KPMG office location during the application process. \n\nWhat your day as a KPMG graduate could look like \n\nYou’ll be part of a team of both experienced and early-career professionals who work on solving problems. The client (they could be an international company, a local charity, a small business) brings us a challenge and we create a team and a plan to help solve it.  \n\nThe work itself is varied depending on your team and the client, so expect to build knowledge of several industries and businesses. You might be analysing data to identify trends and insights, developing AI and machine learning models, enhancing digital customer experiences, integrating new technologies into existing systems, and supporting cybersecurity initiatives to protect client information. \n\nAbout the graduate program \n\nFor students in their final year of study in 2025 or recently graduated and not yet in professional work   \nA one year grow pathway with targeted coaching, support and development as you grow your new career \nReal work from the start so you can make an impact and learn straightaway \nStart work in February 2026 (typically, some teams have a slightly different schedule) with a full time and ongoing graduate role.  \n\nWhat grads say \n\nMy managers have had clear conversations with me about what the expectations are to be able to progress, like cementing a certain skill and that guidance has led me to where I am today. (Michaela, 2015 vacationer now Manager) \n\nWhether it’s a client or other people around the office, I enjoy getting to know other people from all walks of life. (Tim, 2023 grad) \n\nFrom day one I've been involved in real client work alongside a wonderful and friendly team who are more than happy to share their knowledge base and expertise with me. (Emily, 2024 graduate) \n\nIt’s been such a caring environment, and no matter how junior or senior someone is, they are always willing to help you out. (Jordan, 2024 graduate) \n\nLearning about the workings of the world and having the tools and skills to develop viable solutions for all sorts of problems is why I love my job. (Kanwal, 2023 grad) \n\nI already get to work directly with company CFOs and management to help with accounting practices. (Andrew, 2023 grad) \n\nBig things on offer \n\nDirect support: An experienced ‘buddy’ will help you settle in and you’ll always have a dedicated Performance Development Manager focussed on helping you grow professionally. \n\nSkills and career development: apply your knowledge to real world problems with a supportive and experienced team around you, plus structured regular learning sessions to strengthen your skills. \n\nA firm with true commitment to wellbeing, diversity and community: our progress on 21 public commitments is tracked regularly in our Impact Plan, such as our gender pay gap, indigenous inclusion, mental health, learning and more \n\nEmployee discounts: at 100s of stores (like JB HiFi, Woolworths, Airbnb and more) with our SmartSpend app. \n\nBuild your network, friendships and interests: clubs for a variety of interests from running to books, cooking, badminton, video games and so much more.  \n\nAbout KPMG \n\nIn short, we’re the Australian arm of a global network of professional firms providing a full range of services to organisations across a wide range of industries, government, and not-for-profit sectors. We have deep expertise in audit and assurance, tax and advisory.\n\nReady to apply? \n\nGet started now with the 5-minute application form. \nComplete your details \nSelect which area you’d like to join – this pathway you’ve just read about is called ‘Engineering, Technology & Digital’. \n If you’re eligible, you’ll receive our online testing information. Interviews are conducted in person across April. \n\nDuring your recruitment journey, information will be provided about adjustment requests. If you require additional support before submitting your application, please contact our Talent Attraction Team - email: gradrecruiting@kpmg.com.au  ",
    "link": "https://au.prosple.com/graduate-employers/kpmg-australia/jobs-internships/technology-and-digital-graduate-program-0",
    "date": "2025-02-21",
    "alertDate": "",
    "title": "Technology and Digital Graduate Program (Feb 2026)",
    "company": "KPMG Australia",
    "startDate": "9 Feb 2026",
    "index": 1
  },
  {
    "status": "Applied",
    "description": "Launch your career: start your career journey with us early 2026;\nA job that’s made for you: benefit from flexible working options, dressing for your day; and a range of lifestyle and work perks;\nGet the competitive edge: work on real-world projects and alongside some of Australia’s biggest companies.\n\nHow PwC can take you forward  \n\nThere’s so many ways to launch your career and make a positive impact here. It’s why we invest in our people from the ground up – acting as the perfect springboard for aspiring professionals, just like you. \n\nBy working with us, you’ll be helping a variety of Australian businesses create sustainable value through elevated strategies, performances and workflow. So, whether you’re implementing AI technology, developing climate-smart solutions or reinventing Aussie business models, you’ll be making an impact every day.  \n\nYou’ll thrive in a culture that celebrates boundless curiosity and open collaboration. Every day, you’ll be driving meaningful impact and solving complex issues. The relationships and skills you develop along the way will propel you forward. \n\nChoosing the right path \n\nOur Graduate Program is for you if you’re in your final year of study or a recent graduate with an undergraduate or postgraduate degree. This program offers full-time placement, hands-on experience and structured support over the duration of your time with us. You’ll also need to have full-time working rights within Australia at the start of the program. \n\nYour future team will empower you  \n\nTechnology \n\nOur Technology teams focus on harnessing the power of technology to drive innovation, improve processes, and deliver cutting-edge solutions to meet our clients' evolving needs. \n\nBenefits designed to propel you forward – in your career and life \n\nFast-track your career with world-class development opportunities working on real-world problems;\nEmbrace a dynamic community with energising mentors and exposure to experienced leaders;\nEnjoy more autonomy and flexibility with hybrid working arrangements that suit you, your team and clients better;\nDress for your day and feel empowered to work, collaborate and present with clients or team members;\nInvest in your health and lifestyle with perks like wellness credits and discounted memberships.\n\nCommitment to diversity and inclusion \n\nWe value authenticity and unique perspectives, which is why we champion diverse talent from varied backgrounds and with different problem-solving abilities. Because this is what creates impactful creativity and the greatest value for our clients. So even if you don’t meet every qualification, reach out — because it’s your potential that counts. \n\nIf you need any reasonable adjustments or wish to share your pronouns with us, please let us know — we’re committed to ensuring an inclusive experience for all. \n\nReady to move ahead? \n\nIf you’re driven to make an impact and want to experience the energy and openness of a large-scale, top tier firm – join us. We know that with your talent and our energy, we can do great things. \n\nApply now for our Graduate Program!  \n\nTo find out more about our Early Careers head to pwc.com.au/earlycareers  ",
    "link": "https://au.prosple.com/graduate-employers/pwc-australia/jobs-internships/graduate-technology",
    "date": "2025-03-07",
    "alertDate": "",
    "title": "Graduate - Technology (Jan 2026)",
    "company": "PwC Australia",
    "startDate": "12 Jan 2026",
    "index": 2
  },
  {
    "status": "Applied",
    "description": "Our Opportunity\n\nWork location: Perth-based with site travel as required \n\nRoster: Monday to Friday\n\nFortescue is leading the world with our plan to decarbonise our Australian iron ore operations, building renewable energy projects and developing technologies that will change our planet forever.  Our commitment to achieving Real Zero terrestrial emissions (scope 1 and 2) across our Pilbara operations by 2030 is creating exciting and rewarding career opportunities across the globe.\n\nFortescue’s graduate program offers graduates the opportunity to make a real difference in our world by doing real work, focusing on developing, engaging, managing change and achieving results. It’s a balanced approach to technical and professional development, encouraging ‘whole of business’ thinking and ensuring well-rounded capabilities. \n\nOver the two-year program, graduates will complete rotations across up to four different teams, build technical capabilities, working relationships with new people and leadership skills. The program offers a dynamic and hands-on opportunity to enhance your skills and gain valuable industry experience.\n\nAs a graduate, you will be paired with dedicated specialists in your field who will provide professional guidance, supervision and mentoring throughout your rotations. You will work alongside a supportive team, building your operational experience and technical expertise.\n\nKey Responsibilities\nParticipate in rotations across the business either site or Perth based, working on different rosters, to gain exposure to different areas of the business.\nYou will be expected to demonstrate initiative by seeking out projects you believe will best showcase and develop your capabilities.\nDevelop  and expand your skill set with support and guidance from senior colleagues.\nQualifications and Experience\nTertiary qualifications in either Software Development, Artificial Intelligence, Data Science or Technology\nSkills and passion to drive innovation and deliver outcomes\nStrong commitment to safety and aligning with Fortescue's Values\nCurrent full C Class manual licence\nMust have the right to work in Australia (citizens, permanent residents, student or postgraduate work visa holders)\nAbout You\nGraduated with a relevant university degree in the past 12 months or graduating this year\nHigh level evaluation and analysis skills\nProblem solving, innovative thinking\nStrong verbal and written communication skills\nAbility to work with tight timeframes\nPossess a positive attitude and the confidence and willingness to 'have a go'\nPrevious work experience/Internship work (desirable)\nOur Commitment\n\nFortescue celebrates individual strengths and team members are encouraged to bring their whole selves to work. Our global workforce drives and promotes an inclusive culture, both within our organisation and throughout the communities we interact with. Diverse backgrounds include First Nations Peoples, people with disabilities, LGBTQ+ community, gender, neurodiverse, cultural diversity, all age groups, and those with an intersectional or multiple diverse characteristics. We encourage candidates from all backgrounds to apply.",
    "link": "https://au.prosple.com/graduate-employers/fortescue/jobs-internships/graduate-program-technology-data-and-ai",
    "date": "2025-03-07",
    "alertDate": "",
    "title": "Graduate Program - Technology, Data and AI (Nov 2025)",
    "company": "Fortescue",
    "startDate": "1 Nov 2025 - 28 Feb 2026",
    "index": 3
  },
  {
    "status": "Assessment Pending",
    "description": "We are unique\n\nJoin an organisation that values your voice, empowers your autonomy, recognises the strength in diversity, and prioritises your well-being while offering attractive remuneration and benefits. Take pride in having a meaningful impact on regional, rural and remote communities while being a pivotal player in the energy industry's future.   \n\nGraduate Opportunities\n\nAs a Data Graduate with Essential Energy, you’ll be able to build an exciting future with us. You’ll work right across the organisation, becoming recognised as a data expert, having a direct impact on driving the optimisation and improvement of product development and helping to build and construct sophisticated data processing pipelines, amongst other things.\n\nYou will have access to significant learning and development opportunities and have mentorship from within Essential Energy to develop and reach your goals. You will be part of a supportive, community-focused fast-paced environment, building your data expertise and professional networks ensuring great opportunities now and in the future.\n\nYou’ll be part of a program with Engineers Australia and have mentorship from within Essential Energy to develop and reach your goals. Your ability to take advantage of a fast-paced environment in varied parts of the business will build your technical expertise and professional networks ensuring great opportunities now and in the future.\n\nWhat we offer   \n\nNine-day fortnight\nCompetitive remuneration\n16% Superannuation\nEngineers Australia Program\nFitness Passport\nCorporate health plans\nApple and Dell Employee Purchase Programs\nFlexible working arrangements\n26 weeks paid parental leave\nEmployee Assistance Program (EAP)\nA range of learning and development opportunities, including leadership programs and access to LinkedIn Learning\nFantastic local and regional career opportunities\nRelocation Assistance available to successful applicants in accordance with Essential Energy policy\n\nThe Graduate Program officially starts in February 2026, however, an earlier start is available is available for candidates who are keen to start sooner.\n\nAbout you:\n\nIf you are passionate about what you do and are excited to grow your career with a supportive and inclusive team where you will have the opportunity to push boundaries to create innovative solutions to real-world problems all while making positive contributions to the community then this is the opportunity for you.\n\nTo be eligible to apply for these opportunities you will need:\n\nTo have completed a : Bachelor of Data Science, Computer Science, Information Technology, Mathematics, Machine Learning Engineering or a related degree and\nHave Australian or New Zealand citizenship or permanent residency status. \n\nPassionate people. Global thinking. Regional heart.\n\nBuilding a better energy future.\n\nEssential Energy is committed to building a culturally diverse and inclusive workplace and strongly encourages applicants to apply regardless of gender, age, ethnicity, sexual orientation, or disability.  \n\nAs an organisation, our aim is to champion inclusivity in the workplace and celebrate the difference in all our employees.",
    "link": "https://au.prosple.com/graduate-employers/essential-energy/jobs-internships/data-graduate",
    "date": "2025-03-07",
    "alertDate": "2025-03-08",
    "title": "Data Graduate (Feb 2026)",
    "company": "Essential Energy",
    "startDate": "2 Feb 2026 - 13 Feb 2026",
    "index": 4
  },
  {
    "status": "Assessment Pending",
    "description": "What is it like to work at EY Port Jackson Partners?\n\nWe are all about bringing a small group of exceptional people together to solve complex strategy problems. With fewer consultants per Partner, we work in smaller teams than other consulting firms. This means our graduates spend more time learning directly from our Partners who spend meaningful time guiding projects.\n\nSmaller teams mean each person has more influence on the outcome, and that we are more dependent on the contributions of each person. For this reason, we form teams of supportive, clever, curious, and enthusiastic problem solvers. Whatever your background or your aspirations, EY Port Jackson Partners will provide you with the support you need for a successful career.\n\nAt work, your day would look like:\n\nWorking with top-tier Australian and multi-national companies, funds, and state and federal government departments to solve their most critical problems\nWorking with Partners and teammates to contribute to the core problem solving process and interact with clients\nFocusing on interesting strategic priorities, rather than long-term implementation programs or operational issues\n\nEY Port Jackson Partners might be the place for you if:\n\nYou have an outstanding academic track record and have showcased successful extra-curricular activities\nYou are intelligent, curious, analytical, and interested in solving complex commercial and policy problems that have a real impact\nYou want to work in small, close-knit teams alongside great people who are also great problem solvers\nYou want the connection and flexibility that comes with a smaller practice, without compromising the quality of your top-tier strategy consulting experience or the opportunities that come from being part of a global firm\n\nWhat we offer you:\n\nExposure to a variety of industries, clients and interesting projects\nSupport from an individual Development Leader with mentorship, guidance and career development\nOn the job coaching, regular feedback and access to comprehensive training opportunities for your personal development\nHigher education support and global mobility opportunities within EY-Parthenon’s international network\nAn inclusive culture that respects individual differences and values interesting and different perspective to help solve problems\nA calendar full of social & sporting events, offsites and celebrations to continue building connections with your colleagues\n\nHow do I apply?\n\nPlease click through to our website to submit your CV and your most recent academic transcript by Sunday 11:59 pm (AEST), 9 March 2025.\n\nYou may also submit a cover letter. While we do not require one, a cover letter is a good opportunity to offer us a glimpse into who you are beyond your resume and tell us about your motivations and values. If you choose to submit one, we encourage you to make it authentic and reflective of your personality.\n\nOnce you have submitted those documents, the next step in the selection process will be an online assessment, which contains two modules:\n\nNumerical reasoning, which assesses your ability to identify, understand, interpret and manipulate numerical data\nDiagrammatic reasoning, which assesses your ability to analyse and identify patterns in abstract information to draw conclusions and solve problems.\n\nYou will receive an email with a link to complete the assessment. Each module will take an estimated 15 minutes to complete and full instructions will be provided prior to starting. We recommend you complete this on a laptop or desktop computer. Please ensure that you have completed the assessment by Tuesday 11:59pm (AEST), 11 March 2025.\n\nEY PJP is committed to removing systemic barriers to inclusion and improving the employment prospects of people with disability. For this reason, we encourage you to share with us via email at EY Port Jackson Partners Careers any adjustments you may require or information that may help us to ensure you are able to equitably participate in the recruitment process.\n\nWant to know more?\n\nVisit our website (https://eyportjacksonpartners.com/story/spark-ey-port-jackson-partners-womens-scholarship/)\nDiscover what it’s like to work with us, including what we do to enable diversity and inclusion (https://eyportjacksonpartners.com/story/working-with-us/)\nLearn about our interview process (https://eyportjacksonpartners.com/story/application-process/)",
    "link": "https://au.prosple.com/graduate-employers/ey-port-jackson-partners/jobs-internships/graduate-program-4",
    "date": "2025-03-07",
    "alertDate": "2025-03-08",
    "title": "Graduate Program (Feb 2026)",
    "company": "EY Port Jackson Partners",
    "startDate": "",
    "index": 5
  }
]