[
  {
    "status": "Applied",
    "description": "See it differently  \n\nYou see the world through a unique lens and that’s exactly what we need. We embrace how you see things differently – it’s essential for creating a sustainable future. With your ideas and thinking we can solve the most complex challenges facing our clients, climate and communities.  \n\nView opportunities relevant to your degree here. \n\nWhat our graduate development programme offers you:  \n\nPurpose-driven work: Join an employee-owned team tackling climate, biodiversity, and social challenges, aligned with the UN’s Sustainable Development Goals.\nCreate remarkable outcomes: We trust you to explore challenges, drive change, and create lasting outcomes for our clients, climate and communities.\nInclusive culture: Your unique perspective matters. We celebrate diversity and foster a supportive, social environment where everyone belongs.\nCareer growth: Grow your skills through innovative projects, training, and mentoring in a supportive environment. We invest in your future.\nWork-life balance: Our hybrid model offers flexibility to balance work with your life. We balance your needs with our clients and communities.\n\nWhat we offer you \n\nGuided by our values, we provide a fair and equitable total reward package and offer a career in which all our members can belong, grow and thrive through benefits that support health and wellbeing, a wide range of learning opportunities and many possibilities to have an impact through the work they do.  \n\nWe are owned in trust on behalf of our members, giving us the freedom, with personal responsibility, to set our own direction and choose work that aligns with our purpose and adds to Arup’s legacy.  \n\nExplore the perks of a career with Arup Australia & New Zealand: \n\nProfit Share\nHybrid working policy and flexible working hours.\nPaid parental leave for the primary carer of 16 weeks or 32 weeks at half pay and as well as generous unpaid leave benefits.\nPaid parental leave for the support carer plus the opportunity to access extra paid and unpaid leave if you later become the primary carer.\nBirthday leave\nAnnual leave loading\nAbility to purchase additional leave of up to 20 days for permanent employees.\nInternational mobility opportunities\nInsurances (life and income protection)\nInterest free solar energy and bicycle loans\n\nIs this the role you have been looking for? \n\nWe’re looking for recent and soon-to-be graduates passionate about sustainable development and ready to take on any challenge that comes your way.  You will belong to an extraordinary collective where you can express your individuality, share ideas and create remarkable outcomes.  \n\nEligibility Criteria \n\nCandidates are required to have full working rights in the country they are applying to.\nCandidates must have completed their studies prior to commencing the programme they are applying for\nCandidates must be available to start work on or prior to the first day of the programme they are applying to\nCandidates must not have more than 12 months, full-time experience in a similar role\n\nDifferent people, shared values \n\nArup is an equal opportunity employer that actively promotes and nurtures a diverse and inclusive workforce. We welcome applications from individuals of all backgrounds and embrace diverse experiences, perspectives, and ideas – this drives our excellence.  \n\nWe are committed to making our recruitment process and workplaces accessible to all candidates. Please let us know if you need any assistance or reasonable adjustments throughout your application or interview process, and/or to perform the essential functions of the role. We will do everything we can to support you. \n\nJoin Arup’s #1 ranked Graduate Programme, where your unique ideas help solve the world’s toughest challenges. ",
    "link": "https://au.prosple.com/graduate-employers/arup-australia/jobs-internships/data-computer-science-graduate-development-programme",
    "date": "2025-02-21",
    "alertDate": "",
    "title": "Data & Computer Science Graduate Development Programme (Sep 2025)",
    "company": "Arup Australia",
    "startDate": "1 Sep 2025",
    "index": 0
  }
]