[
  {
    "status": "Applied",
    "description": "See it differently  \n\nYou see the world through a unique lens and that’s exactly what we need. We embrace how you see things differently – it’s essential for creating a sustainable future. With your ideas and thinking we can solve the most complex challenges facing our clients, climate and communities.  \n\nView opportunities relevant to your degree here. \n\nWhat our graduate development programme offers you:  \n\nPurpose-driven work: Join an employee-owned team tackling climate, biodiversity, and social challenges, aligned with the UN’s Sustainable Development Goals.\nCreate remarkable outcomes: We trust you to explore challenges, drive change, and create lasting outcomes for our clients, climate and communities.\nInclusive culture: Your unique perspective matters. We celebrate diversity and foster a supportive, social environment where everyone belongs.\nCareer growth: Grow your skills through innovative projects, training, and mentoring in a supportive environment. We invest in your future.\nWork-life balance: Our hybrid model offers flexibility to balance work with your life. We balance your needs with our clients and communities.\n\nWhat we offer you \n\nGuided by our values, we provide a fair and equitable total reward package and offer a career in which all our members can belong, grow and thrive through benefits that support health and wellbeing, a wide range of learning opportunities and many possibilities to have an impact through the work they do.  \n\nWe are owned in trust on behalf of our members, giving us the freedom, with personal responsibility, to set our own direction and choose work that aligns with our purpose and adds to Arup’s legacy.  \n\nExplore the perks of a career with Arup Australia & New Zealand: \n\nProfit Share\nHybrid working policy and flexible working hours.\nPaid parental leave for the primary carer of 16 weeks or 32 weeks at half pay and as well as generous unpaid leave benefits.\nPaid parental leave for the support carer plus the opportunity to access extra paid and unpaid leave if you later become the primary carer.\nBirthday leave\nAnnual leave loading\nAbility to purchase additional leave of up to 20 days for permanent employees.\nInternational mobility opportunities\nInsurances (life and income protection)\nInterest free solar energy and bicycle loans\n\nIs this the role you have been looking for? \n\nWe’re looking for recent and soon-to-be graduates passionate about sustainable development and ready to take on any challenge that comes your way.  You will belong to an extraordinary collective where you can express your individuality, share ideas and create remarkable outcomes.  \n\nEligibility Criteria \n\nCandidates are required to have full working rights in the country they are applying to.\nCandidates must have completed their studies prior to commencing the programme they are applying for\nCandidates must be available to start work on or prior to the first day of the programme they are applying to\nCandidates must not have more than 12 months, full-time experience in a similar role\n\nDifferent people, shared values \n\nArup is an equal opportunity employer that actively promotes and nurtures a diverse and inclusive workforce. We welcome applications from individuals of all backgrounds and embrace diverse experiences, perspectives, and ideas – this drives our excellence.  \n\nWe are committed to making our recruitment process and workplaces accessible to all candidates. Please let us know if you need any assistance or reasonable adjustments throughout your application or interview process, and/or to perform the essential functions of the role. We will do everything we can to support you. \n\nJoin Arup’s #1 ranked Graduate Programme, where your unique ideas help solve the world’s toughest challenges. ",
    "link": "https://au.prosple.com/graduate-employers/arup-australia/jobs-internships/data-computer-science-graduate-development-programme",
    "date": "2025-02-21",
    "alertDate": "",
    "title": "Data & Computer Science Graduate Development Programme (Sep 2025)",
    "company": "Arup Australia",
    "startDate": "1 Sep 2025",
    "index": 0
  },
  {
    "status": "Assessment Done",
    "description": "Why choose Technology and Digital areas as a grad? \n\nWant to play a part in how technology shapes our world and the world of generations to come? Graduates across technology and digital areas are at the forefront of driving innovation and challenging the status-quo for organisations as they look for ways to harness new developments ethically, sustainably and with maximum efficiency to their customers. Depending on your team and specialisation, you'll deal with day-to-day challenges and big-picture problems facing organisations and society. From ethical hacking and AI to IT strategy development, cyber security, cloud implementation and much more, a graduate role in a digital or tech team will see you set for a career with a big impact for the long term. \n\nLocation of this job: nominate your KPMG office location during the application process. \n\nWhat your day as a KPMG graduate could look like \n\nYou’ll be part of a team of both experienced and early-career professionals who work on solving problems. The client (they could be an international company, a local charity, a small business) brings us a challenge and we create a team and a plan to help solve it.  \n\nThe work itself is varied depending on your team and the client, so expect to build knowledge of several industries and businesses. You might be analysing data to identify trends and insights, developing AI and machine learning models, enhancing digital customer experiences, integrating new technologies into existing systems, and supporting cybersecurity initiatives to protect client information. \n\nAbout the graduate program \n\nFor students in their final year of study in 2025 or recently graduated and not yet in professional work   \nA one year grow pathway with targeted coaching, support and development as you grow your new career \nReal work from the start so you can make an impact and learn straightaway \nStart work in February 2026 (typically, some teams have a slightly different schedule) with a full time and ongoing graduate role.  \n\nWhat grads say \n\nMy managers have had clear conversations with me about what the expectations are to be able to progress, like cementing a certain skill and that guidance has led me to where I am today. (Michaela, 2015 vacationer now Manager) \n\nWhether it’s a client or other people around the office, I enjoy getting to know other people from all walks of life. (Tim, 2023 grad) \n\nFrom day one I've been involved in real client work alongside a wonderful and friendly team who are more than happy to share their knowledge base and expertise with me. (Emily, 2024 graduate) \n\nIt’s been such a caring environment, and no matter how junior or senior someone is, they are always willing to help you out. (Jordan, 2024 graduate) \n\nLearning about the workings of the world and having the tools and skills to develop viable solutions for all sorts of problems is why I love my job. (Kanwal, 2023 grad) \n\nI already get to work directly with company CFOs and management to help with accounting practices. (Andrew, 2023 grad) \n\nBig things on offer \n\nDirect support: An experienced ‘buddy’ will help you settle in and you’ll always have a dedicated Performance Development Manager focussed on helping you grow professionally. \n\nSkills and career development: apply your knowledge to real world problems with a supportive and experienced team around you, plus structured regular learning sessions to strengthen your skills. \n\nA firm with true commitment to wellbeing, diversity and community: our progress on 21 public commitments is tracked regularly in our Impact Plan, such as our gender pay gap, indigenous inclusion, mental health, learning and more \n\nEmployee discounts: at 100s of stores (like JB HiFi, Woolworths, Airbnb and more) with our SmartSpend app. \n\nBuild your network, friendships and interests: clubs for a variety of interests from running to books, cooking, badminton, video games and so much more.  \n\nAbout KPMG \n\nIn short, we’re the Australian arm of a global network of professional firms providing a full range of services to organisations across a wide range of industries, government, and not-for-profit sectors. We have deep expertise in audit and assurance, tax and advisory.\n\nReady to apply? \n\nGet started now with the 5-minute application form. \nComplete your details \nSelect which area you’d like to join – this pathway you’ve just read about is called ‘Engineering, Technology & Digital’. \n If you’re eligible, you’ll receive our online testing information. Interviews are conducted in person across April. \n\nDuring your recruitment journey, information will be provided about adjustment requests. If you require additional support before submitting your application, please contact our Talent Attraction Team - email: gradrecruiting@kpmg.com.au  ",
    "link": "https://au.prosple.com/graduate-employers/kpmg-australia/jobs-internships/technology-and-digital-graduate-program-0",
    "date": "2025-02-21",
    "alertDate": "",
    "title": "Technology and Digital Graduate Program (Feb 2026)",
    "company": "KPMG Australia",
    "startDate": "9 Feb 2026",
    "index": 1
  }
]